Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Содержимое всплывающего окна', viewportOffset : 100 }
en: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Content of the popup', viewportOffset : 100 }

source: Поле zIndexGroupLevel
en: zIndexGroupLevel field

source: Определяет уровень слоя для каждого всплывающего окна.
en: Specifies the level of the popup layer.

source: Использует блок z-index-group.
en: Uses the z-index-group block.

source: Используется для отображения и управления группой однотипных переключателей – чекбоксов.
en: Use this block for managing a group of – checkboxes.

source: Тип группы чекбоксов.
en: The type of checkbox group.

source: Размер группы чекбоксов. Используется только для чекбоксов с модификатором theme в значении islands.
en: The size of checkbox group. Use sizes only for checkboxes with the theme modifier set to islands.

source: Набор значений выбранных чекбоксов.
en: A set of values for the selected checkboxes.

source: Набор значений для каждого чекбокса группы. Каждому типу чекбоксов соответствует разный набор значений.
en: A set of values for each checkbox of the group. Each checkbox has its own set of values.

source: Блок checkbox-group позволяет управлять внешним видом и состоянием вложенных чекбоксов.
en: Use the checkbox-group block to control the size, state, and appearance of the checkboxes in the group.

source: Кнопочный чекбокс (модификатор type в значении button)
en: The type of checkbox group ( type modifier with button value).

source: Позволяет реализовать блок checkbox-group с помощью чекбоксов с типом button. Все чекбоксы группы в данном случае всегда располагаются в линию.
en: Implements the checkbox-group block using the button type of checkboxes. Grouped button-based checkboxes are always aligned in a line.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: Применяется к группе чекбоксов для выравнивания их в линию.
en: The modifier aligns all checkboxes of the group in a line.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'line' }, name : 'checkbox-line', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'line' }, name : 'checkbox-button', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: всей группе чекбоксов
en: The checkbox-group:

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'checkbox', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'checkbox', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name : 'checkbox-button', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' disabled : true }, name : 'checkbox-button', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: отдельному чекбоксу в группе
en: The separate checkbox of the group:

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-line', options : [ { val : 1, text : 'Блок', disabled : true }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-line', options : [ { val : 1, text : 'Block', disabled : true }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-line', options : [ { val : 1, text : 'Блок', disabled : true }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-line', options : [ { val : 1, text : 'Block', disabled : true }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', focused : true }, name : 'checkbox', val : [2], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', focused : true }, name : 'checkbox', val : [2], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'checkbox-button', val : [2], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'checkbox-button', val : [2], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-islands', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-islands', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: Задает размер всем чекбоксам в группе.
en: Sets the size value for all types of checkbox groups.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-button', val : [1, 2], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-button', val : [1, 2], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button', val : [2, 3], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button', val : [2, 3], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'l' }, name : 'checkbox-button', val : [1, 2], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'l' }, name : 'checkbox-button', val : [1, 2], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'checkbox-button', val : [2, 3], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'checkbox-button', val : [2, 3], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: Тип: String
en: Type: String

source: Определяет уникальное имя группы чекбоксов.
en: Specifies the block unique name.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button-1', options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button-1', options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: Опеределяет набор значений выбранных радиопереключателей.
en: Specifies a set of values for the selected checkboxes.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button-1', val : [1, 2], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент' }, { val : 3, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-button-1', val : [1, 2], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element' }, { val : 3, text : 'Modifier' } ] }

source: Тип: Array
en: Type: Array

source: Определяет набор значений для каждого чекбокса группы.
en: Specifies a set of values for each checkbox of the group.

source: Каждому типу чекбоксов соответствует разный набор значений.
en: Each checkbox has its own set of values.

source: Значение, возвращаемое чекбоксом, если он выбран.
en: The value to send to the server if the checkbox is selected.

source: Текст подписи к чекбоксу или текст кнопки чекбокса, если выбран модификатор type в значении button.
en: The checkbox label, or the button label if the type modifier is set to button.

source: Иконка. Формируется блоком icon. Используется только для группы чекбоксов с модификатором type в значении button.
en: The checkbox icon, which is created by the icon block. Use icons only for checkboxes with the type modifier set to button.

source: Текст сплывающей подсказки. Используется только для группы чекбоксов с модификатором type в значении button.
en: Tooltip content. Use tooltips only for checkboxes with type modifier set to button.

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-islands', val : [1, 3], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент', disabled : true }, { val : 3, text : 'Модификатор', disabled : true }, { val : 4, text : 'Модификатор' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm' }, name : 'checkbox-islands', val : [1, 3], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element', disabled : true }, { val : 3, text : 'Modifier', disabled : true }, { val : 4, text : 'Modifier' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', val : [3], options : [ { val : 1, text : 'Блок' }, { val : 2, text : 'Элемент', disabled : true, title : 'Неактивен' }, { val : 3, text : 'Модификатор', disabled : true, title : 'Отмечен и неактивен' } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', val : [3], options : [ { val : 1, text : 'Block' }, { val : 2, text : 'Element', disabled : true, title : 'Disabled' }, { val : 3, text : 'Modifier', disabled : true, title : 'Checked and disable' } ] }

source: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', val : [1], options : [ { val : 1, text : 'Twitter', title : 'Подписаться на новости БЭМ', icon : { block : 'icon', mods : { social : 'twitter' } } }, { val : 2, text : 'ВКонтакте', disabled : true, title : 'Подписаться на новости БЭМ', icon : { block : 'icon', mods : { social : 'vk' } } } ] }
en: { block : 'checkbox-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'checkbox-islands', val : [1], options : [ { val : 1, text : 'Twitter', title : 'Follow BEM on Twitter', icon : { block : 'icon', mods : { social : 'twitter' } } }, { val : 2, text : 'ВКонтакте', disabled : true, title : 'Follow BEM on VKontakte', icon : { block : 'icon', mods : { social : 'vk' } } } ] }

source: Используется для вставки самостоятельных изображений.
en: Use this block for creating an independent image.

source: Альтернативный текст для изображения.
en: The alternate text of the image.

source: Адрес изображения.
en: Image address.

source: Ширина изображения в пикселях.
en: The width of the image in pixels.

source: Высота изображения в пикселях.
en: The height of the image in pixels.

source: Блок image предназначен для вставки самостоятельных изображений. Адаптирован для вывода в специальных режимах (чтения, печати, для людей с ограниченными возможностями).
en: The block image is used to create an independent image that is adapted for specific output modes (screen reader, print, programs for people with limited physical capacities).

source: Определяет текст всплывающей подсказки.
en: Specifies the tooltip content.

source: { block : 'image', url : 'https://img-fotki.yandex.ru/get/16159/259818507.0/0_130be6_4116d8e7_S', title : 'Все подробности на bem.info' }
en: { block : 'image', url : 'https://img-fotki.yandex.ru/get/16159/259818507.0/0_130be6_4116d8e7_S', title : 'Find detailed description on bem.info' }

source: Поле alt
en: alt field

source: Определяет альтернативный текст для изображений. Такой текст позволяет получить информацию об изображении, если браузер по каким-то причинам не может его отобразить.
en: Specifies the alternate text of the image. The text provides useful information about the image if a browser cannot display it for some reasons.

source: Определяет адрес, с которого загружается изображение.
en: Specifies the address for the image uploading.

source: Поле width
en: width field

source: Определяет ширину изображения в пикселях.
en: Specifies the image width in pixels.

source: Поле height
en: height field

source: Определяет высоту изображения в пикселях.
en: Specifies the image height in pixels.

source: Используется для создания различных типов текстовых полей.
en: Use this block for creating different types of text fields.

source: Тип текстового поля.
en: The type of the text field.

source: Максимально допустимая ширина текстового поля.
en: The maximum allowed width of the text field.

source: Крестик для очистки поля ввода.
en: The element that clears the input field content.

source: Размер текстового поля. Используется только с модификатором theme в значении islands.
en: The size of the text field. Use sizes only for text fields when the theme modifier is set to islands.

source: Содержимое поля ввода, указанное по умолчанию.
en: Default content of the text field.

source: Подсказка в текстовом поле.
en: The hint in the text field.

source: Максимальное количество вводимых символов.
en: The maximum number of characters allowed in the text field.

source: Браузерное автозаполнение в текстовом поле.
en: Browser predictions of the rest of a word while a user is typing.

source: Уникальный идентификатор текстового поля.
en: The unique identifier of the text field.

source: Блок input служит для создания различных типов текстовых полей.
en: Use the input block to control the size, state and appearance of the text fields.

source: Допустимые значения: 'password', 'search'.
en: Acceptable values: 'password', 'search'.

source: Модификатор type используется для изменения типа текстового поля.
en: type modifier changes types of the text fields.

source: По умолчанию (если модификатор type не установлен) блок input является обычным полем ввода.
en: The type of the text field. By default (if type modifier is not set) the input block is a common input field.

source: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Введите имя' }
en: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Enter your name' }

source: Поле для ввода пароля (модификатор type в значении password)
en: Password field (type modifier with password value)

source: Используется для создания поля для ввода пароля. Отличается от обычного тем, что все вводимые символы отображаются звездочками, точками или другими знаками в зависимости от используемого браузера.
en: Use to create the specialized text fields for a password entry. For security reasons, the password field does not show the characters that the user types. Instead, the field displays the character different from the one typed such as an asterisk '*' (depends on a browser).

source: { block : 'input', mods : { theme : 'islands', size: 'm', type : 'password' }, placeholder : 'Введите пароль' }
en: { block : 'input', mods : { theme : 'islands', size: 'm', type : 'password' }, placeholder : 'Enter the passwor' }

source: Поле для поиска (модификатор type в значении search)
en: Search field (type modifier with search value)

source: Используется для создания поискового поля.
en: Use to create the search field.

source: { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Введите запрос' }
en: { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Enter your question' }

source: Позволяет растягивать текстовое поле на максимально допустимую ширину.
en: Use to set the maximum available width to the text field.

source: { block : 'input', mods : { theme : 'islands', size : 'm', width : 'available' }, placeholder : 'Введите имя' }
en: { block : 'input', mods : { theme : 'islands', size : 'm', width : 'available' }, placeholder : 'Enter your name' }

source: Модификатор has-clear
en: has-clear modifier

source: Добавляет крестик для очистки содержимого в текстовое поле.
en: Use this modifier to add the clear element into the text field to remove entered content.

source: { block : 'input', mods : { theme : 'islands', size : 'm', 'has-clear' : true }, val : 'Привет!' }
en: { block : 'input', mods : { theme : 'islands', size : 'm', 'has-clear' : true }, val : 'Hello!' }

source: { block : 'input', mods : { theme : 'islands', size : 'm', disabled : true }, placeholder : 'Введите имя' }
en: { block : 'input', mods : { theme : 'islands', size : 'm', disabled : true }, placeholder : 'Enter your nam' }

source: { block : 'input', mods : { theme : 'islands', size : 'm', focused : true }, placeholder : 'Введите имя' }
en: { block : 'input', mods : { theme : 'islands', size : 'm', focused : true }, placeholder : 'Enter your name' }

source: { block : 'input', mods : { theme : 'islands', size: 'm', type : 'search' }, placeholder : 'Введите запрос' }
en: { block : 'input', mods : { theme : 'islands', size: 'm', type : 'search' }, placeholder : 'Enter your question' }

source: Задает размер всем типам текстовых полей.
en: Sets the size value for all types of text fields.

source: { block : 'input', mods : { theme : 'islands', size: 's' }, placeholder : 'Размер s' }
en: { block : 'input', mods : { theme : 'islands', size: 's' }, placeholder : 'Size s' }

source: { block : 'input', mods : { theme : 'islands', size: 'm' }, placeholder : 'Размер m' }
en: { block : 'input', mods : { theme : 'islands', size: 'm' }, placeholder : 'Size m' }

source: { block : 'input', mods : { theme : 'islands', size: 'l' }, placeholder : 'Размер l' }
en: { block : 'input', mods : { theme : 'islands', size: 'l' }, placeholder : 'Size l' }

source: { block : 'input', mods : { theme : 'islands', size: 'xl' }, placeholder : 'Размер xl' }
en: { block : 'input', mods : { theme : 'islands', size: 'xl' }, placeholder : 'Size xl' }

source: Тип данных: String.
en: Type: String.

source: Определяет содержимое поля ввода.
en: Specifies the content of the text field.

source: { block : 'input', mods : { theme : 'islands', size: 'm' }, name : 'Statistics', val : 'Привет!' }
en: { block : 'input', mods : { theme : 'islands', size: 'm' }, name : 'Statistics', val : 'Hello!' }

source: Определяет текст подсказки в текстовом поле.
en: Specifies the hint in the text field.

source: Поле maxLength
en: maxLength field

source: Тип данных: Number.
en: Type: Number.

source: Определяет максимальное количество вводимых символов.
en: Specifies the maximum number of characters allowed in the text field.

source: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Введите имя', maxLength : 20 }
en: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Enter your name', maxLength : 20 }

source: Поле autocomplete
en: autocomplete field

source: Тип данных: Boolean.
en: Type: Boolean.

source: Отвечает за включение / выключение автозаполнения текстового поля в браузере.
en: Specifies the browser predictions of the rest of the word while a user is typing.

source: Если поле autocomplete не задано, автозаполнение включено.
en: If the autocomplete field is not specified, the autocomplete function is turned on by default.

source: Для отключения автозаполнения используйте значение false:
en: To turn off the autocomplete function, use the false value:

source: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Введите имя', autocomplete : false }
en: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Enter your name', autocomplete : false }

source: Определяет уникальный идентификатор текстового поля.
en: Specifies the text field unique ID.

source: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Введите имя', id : 'Unique_1' }
en: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Enter your name', id : 'Unique_1' }

source: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Введите имя', tabIndex : 3 }
en: { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Enter your name', tabIndex : 3 }

source: Используется в составе блока radio-group для создания радиопереключателей.
en: Use this block as a part of the radio-group block for creating a single radio switch.

source: Тип радиопереключателя.
en: The type of the radio switch.

source: Выбор радиопереключателя.
en: Selection of the radio switch.

source: Размер радиопереключателя.
en: The size of the radio switch.

source: Имя радиопереключателя.
en: The name of the radio switch.

source: Значение, возвращаемое радиопереключателем, если он выбран.
en: The value to send to the server if the radio switch is selected.

source: Иконка. Формируется блоком icon. Используется для радиопереключателя с модификатором type в значении button.
en: Radio switch icon. It is created by the icon block. Use icons only for radio switches when the type modifier is set to button.

source: Текст всплывающей подсказки. Используется для радиопереключателя с модификатором type в значении button.
en: Tooltip content. Use tooltips only for radio switches when the type modifier is set to button.
